In [2]:
import numpy as np
import pandas as pd

In [3]:
pwd

'/home/ben10/workbench'

In [5]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df =pd.read_csv('example')

In [13]:
df.to_csv('my_output',index=False)

In [14]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df.to_excel('my_exc_output.xlsx')

In [20]:
pd.read_excel('my_exc_output.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
data =pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [37]:
from sqlalchemy import create_engine

In [39]:
engine =create_engine('sqlite:///:memory:')

In [40]:
df.to_sql('my_table',engine)

In [41]:
sqldf=pd.read_sql('my_table',con=engine)

In [42]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15